Revit 2027 API
RebarShapeBendAngle Enumeration
 A bend in a rebar shape has an angular range specified by one of these values. The angles refer to the angle swept out by one segment as it is bent relative to another. That is, an "Obtuse" bend results in two segments that meet at an angle that is less than 90 degrees when measured internally. Put another way, to create an equilateral triangle, you would need two "Obtuse" bends.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarShapeBendAngle
Public Enumeration RebarShapeBendAngle
public enum class RebarShapeBendAngle
type RebarShapeBendAngle
Members
Member name | Value | Description
Acute | 1 |  The angle is less than 90 degrees.
Obtuse | 3 |  The angle is between 90 and 180 degrees.
Right | 2 |  The angle is 90 degrees.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace